GitGriever/Game/Keil_v5/ARM/Boards/Atmel/SAM3X-EK/RL/TCPnet/Library/GLCD_16bitIF_SAM3X.c
/*******************************************************************************
* Write a value to the to LCD register                                         *
*   Parameter:    reg:    register to be written                               *
*                 val:    value to write to the register                       *
*******************************************************************************/

static __inline void wr_reg (unsigned char reg, unsigned short val) {

  wr_cmd(reg);
  wr_dat(val);
}

#if 0
/*******************************************************************************
* Read from the LCD register                                                   *
*   Parameter:    reg:    register to be read                                  *
*   Return:               value read from the register                         *
*******************************************************************************/

static unsigned short rd_reg (unsigned char reg) {

  wr_cmd(reg);
  return(rd_dat());
}
#endif

/************************ Exported functions **********************************/

/*******************************************************************************
* Initialize the Graphic LCD controller                                        *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/
/* PMC Write Protect Mode Keys */
#define PMC_WPEN_KEY        0x504D4301
#define PMC_WPDIS_KEY       0x504D4300

/* PIO Write Protect Mode Keys */
#define PIO_WPEN_KEY        0x50494F01
#define PIO_WPDIS_KEY       0x50494F00


#define LCD_D0_D15      (0x0003FFFC)      /* PIO_PC2 .. PIO_PC17 Peripheral A */
#define LCD_RS          (PIO_PC22)
#define LCD_RD          (PIO_PA29B_NRD)
#define LCD_WR          (PIO_PC18A_NWE)
#define LCD_NCS2        (PIO_PB24B_NCS2)
#define LCD_BACKLIGHT   (PIO_PB27)

void GLCD_Init (void) {
  unsigned int mode, i;


  PMC->PMC_WPMR  = PMC_WPDIS_KEY;               /* Disable write protection   */
  PIOA->PIO_WPMR = PIO_WPDIS_KEY;               /* Disable write protection   */
  PIOB->PIO_WPMR = PIO_WPDIS_KEY;               /* Disable write protection   */
  PIOC->PIO_WPMR = PIO_WPDIS_KEY;               /* Disable write protection   */

  /* Configure the LCD Control pins --------------------------------------------*/
  PMC->PMC_PCER0  = ((1 << ID_PIOA) |           /* Enable clock for PIOA      */
                     (1 << ID_PIOB) |           /* Enable clock for PIOB      */
                     (1 << ID_PIOC) );          /* Enable clock for PIOC      */

/* Configure the Data Bus pins -----------------------------------------------*/
  PIOC->PIO_PDR   =  (LCD_D0_D15);              /* Enable Peripheral function */
  PIOC->PIO_IDR   =  (LCD_D0_D15);              /* Disable interrupt          */
  PIOC->PIO_ABSR &= ~(LCD_D0_D15);              /* Select Peripheral A        */

/* Configure the Control pins ------------------------------------------------*/
  PIOC->PIO_PDR   =  (LCD_RS);                  /* Enable Peripheral function */
  PIOC->PIO_IDR   =  (LCD_RS);                  /* Disable interrupt          */
  PIOC->PIO_ABSR &= ~(LCD_RS);                  /* Select Peripheral A        */

  PIOA->PIO_PDR   =  (LCD_RD);                  /* Enable Peripheral function */
  PIOA->PIO_IDR   =  (LCD_RD);                  /* Disable interrupt          */
  PIOA->PIO_ABSR |=  (LCD_RD);                  /* Select Peripheral B        */

  PIOC->PIO_PDR   =  (LCD_WR);                  /* Enable Peripheral function */
  PIOC->PIO_IDR   =  (LCD_WR);                  /* Disable interrupt          */
  PIOC->PIO_ABSR &= ~(LCD_WR);                  /* Select Peripheral A        */

  PIOB->PIO_PDR   =  (LCD_NCS2);                /* Enable Peripheral function */
  PIOB->PIO_IDR   =  (LCD_NCS2);                /* Disable interrupt          */
  PIOB->PIO_ABSR |=  (LCD_NCS2);                /* Select Peripheral B        */

/* Configure the Backlight pins ----------------------------------------------*/
  PIOB->PIO_IDR   =                             /* Disable interrupt          */
  PIOB->PIO_OER   =                             /* Enable output              */
  PIOB->PIO_PER   = (LCD_BACKLIGHT);            /* Disable Peripheral function*/
  PIOB->PIO_CODR  = (LCD_BACKLIGHT);            /* Backlight off              */

/*-- SMC Configuration -------------------------------------------------------*/
/*--------------------------- CS2 --------------------------------------------*/
  PMC->PMC_PCER0  = (1 << ID_SMC);              /* Enable clock for SMC       */

  SMC->SMC_CS_NUMBER[2].SMC_SETUP = 0
                                 | (( 4 <<  0) & SMC_SETUP_NWE_SETUP_Msk)
                                 | (( 2 <<  8) & SMC_SETUP_NCS_WR_SETUP_Msk)
                                 | (( 4 << 16) & SMC_SETUP_NRD_SETUP_Msk)
                                 | (( 2 << 24) & SMC_SETUP_NCS_RD_SETUP_Msk)
                                 ;

  SMC->SMC_CS_NUMBER[2].SMC_PULSE = 0
                                 | ((  5 <<  0) & SMC_PULSE_NWE_PULSE_Msk)
                                 | (( 18 <<  8) & SMC_PULSE_NCS_WR_PULSE_Msk)
                                 | ((  5 << 16) & SMC_PULSE_NRD_PULSE_Msk)
                                 | (( 18 << 24) & SMC_PULSE_NCS_RD_PULSE_Msk)
                                 ;

  SMC->SMC_CS_NUMBER[2].SMC_CYCLE = 0
                                 | ((22 <<  0) & SMC_CYCLE_NWE_CYCLE_Msk)
                                 | ((22 << 16) & SMC_CYCLE_NRD_CYCLE_Msk)
                                 ;

  mode = SMC->SMC_CS_NUMBER[2].SMC_MODE;
  SMC->SMC_CS_NUMBER[2].SMC_MODE  = (mode & ~(SMC_MODE_DBW | SMC_MODE_READ_MODE | SMC_MODE_WRITE_MODE))
                                 | (SMC_MODE_READ_MODE)
                                 | (SMC_MODE_WRITE_MODE)
                                 | (SMC_MODE_DBW)
                                 ;

  delay(5);                             /* Delay 50 ms                        */

  /* Start internal OSC                                                       */
  wr_reg(0x19, 0x49);                   /* OSCADJ=10 0000, OSD_EN=1 // 60Hz   */
  wr_reg(0x93, 0x0C);                   /* RADJ=1100                          */

  /* Power on flow                                                            */
  wr_reg(0x44, 0x4D);                   /* VCM=100 1101                       */
  wr_reg(0x45, 0x11);                   /* VDV=1 0001                         */
  wr_reg(0x20, 0x40);                   /* BT=0100                            */
  wr_reg(0x1D, 0x07);                   /* VC1=111                            */
  wr_reg(0x1E, 0x00);                   /* VC3=000                            */
  wr_reg(0x1F, 0x04);                   /* VRH=0100                           */

  wr_reg(0x1C, 0x04);                   /* AP=100                             */
  wr_reg(0x1B, 0x10);                   /* GASENB=0, PON=1, DK=0, XDK=0, DDVDH_TRI=0, STB=0 */
  delay(5);

  wr_reg(0x43, 0x80);                   /* Set VCOMG=1                        */
  delay(5);

